---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.Clear
source: html/31db605d-604d-7367-dbb0-6249fdbdf40e.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```